In [25]:
# import all modules 
import pandas as pd 
import numpy as np 
import sqlite3 
from Tools.conversation import start_end_customers_filter
import time 
import os
import json

#### 1. connect to the database

In [19]:
con = sqlite3.connect('../database/database(620).db')

In [24]:
query = """
    SELECT conversation.id_1, conversation.airline_name, general_tweets.timestamp_
    FROM conversation, general_tweets
    WHERE general_tweets.id == conversation.id_1
"""
df = pd.read_sql_query(query, con)

DatabaseError: Execution failed on sql '
    SELECT conversation.id_1, conversation.airline_name, general_tweets.timestamp_
    FROM conversation, general_tweets
    WHERE general_tweets.id == conversation.id_1
': no such column: general_tweets.timestamp_

In [10]:
df.head()

                     id_1     airline_name
0  1.1311730105080627e+18  British_Airways
1  1.1311759953215201e+18  British_Airways
2  1.1311767275755356e+18           Qantas
3  1.1311768612104315e+18   VirginAtlantic
4   1.131177590490882e+18      AmericanAir